from oujilide import extended_gcd as gcd
import  random
def fermat(m,k):
    p=1-0.5**k
    743476040059754298379331647007684224429004972336533937786799284757790400765316630522369642718204165253922832684184615021404737105614714107158733905598636152327037707290538422718453498125366750918857659068838460954633737911274770976191590193809661578032117496009853673140977556559136466107768672598883924301125589893895001253674886100289402530711221893
    count=0
    while count < k :
        count += 1
        a = random.randint(2, m - 2)
        g = gcd(a, m)
        if g[0] != 1 :
            print(f"{m}为合数")
            break
        r = pow(a,m-1,m)
        if r != 1 :
            print(f"{m}为合数")
            break
    if count == k:
        print(f"{m}有{100*p}%的概率为质数")
if __name__ == "__main__":
    m=int(input("m="))
    k=int(input("k="))
    fermat(m,k)